src/toir_cf/src/Catalogs/торо_СпособыПланированияРемонтныхРабот/торо_СпособыПланированияРемонтныхРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>торо_СпособыПланированияРемонтныхРабот</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ДеньНедели</name>
    <type>
      <types>EnumRef.ДниНедели</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПериодов</name>
    <comment>(Упр)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>(Упр)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодичностьРемонтныхРабот</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСрокФормированияЗаявки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПараметрыНаработки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПериодичность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеУчитыватьПриПланированииГрафикРаботыОборудования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрНаработки</name>
    <type>
      <types>CatalogRef.ПараметрыВыработкиОС</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеПараметраНаработки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыполнятьОднократно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПараметрыНаработки</name>
    <attributes>
      <name>ЗначениеПараметраНаработки</name>
      <comment>(Упр)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПараметрНаработки</name>
      <type>
        <types>CatalogRef.ПараметрыВыработкиОС</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Сезонность</name>
    <attributes>
      <name>СезонДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СезонДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/toir_cf/src/Enums/ДниНедели/ДниНедели.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ДниНедели</name>
  <enumValues>
    <name>Понедельник</name>
  </enumValues>
  <enumValues>
    <name>Вторник</name>
  </enumValues>
  <enumValues>
    <name>Среда</name>
  </enumValues>
  <enumValues>
    <name>Четверг</name>
  </enumValues>
  <enumValues>
    <name>Пятница</name>
  </enumValues>
  <enumValues>
    <name>Суббота</name>
  </enumValues>
  <enumValues>
    <name>Воскресенье</name>
  </enumValues>
</mdclass:Enum>

src/toir_cf/src/Catalogs/торо_СпособыПланированияРемонтныхРабот/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	Контекст = Новый Структура();
	Контекст.Вставить("Объект",                     Объект);
	Контекст.Вставить("ИмяЭлементаДляРазмещения",   "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтаФорма, Контекст);
	// Конец СтандартныеПодсистемы.Свойства
	
	// Функциональные опции
	
	ФОУчетНаработкиОборудования = ПолучитьФункциональнуюОпцию("торо_УчетНаработкиОборудования");
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	Если Объект.ПараметрыНаработки.Количество() > 1 Тогда
		СписокПараметровНаработки = Истина;
	Иначе
		СписокПараметровНаработки = Ложь;
		Если Объект.ПараметрыНаработки.Количество() > 0 Тогда
			ПараметрНаработки          = Объект.ПараметрыНаработки[0].ПараметрНаработки;
			ЗначениеПараметраНаработки = Объект.ПараметрыНаработки[0].ЗначениеПараметраНаработки;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ДеньНедели) Тогда
		УчитыватьДеньНедели = Истина;
	Иначе
		УчитыватьДеньНедели = Ложь;
	КонецЕсли;
	

	// Настройка видимости элементов планирования по периодичности
	Элементы.ГруппаПериодичность.Видимость = Объект.ИспользоватьПериодичность;/////
	Элементы.УчитыватьДеньНедели.Доступность = Объект.ИспользоватьПериодичность;
	Элементы.ДеньНедели.Доступность          = УчитыватьДеньНедели;
	
	// Настройка видимости элементов планирования по наработке
	Элементы.ГруппаПараметрыНаработки.Видимость  = ФОУчетНаработкиОборудования И Объект.ИспользоватьПараметрыНаработки; /////
	Элементы.ПараметрыНаработки.Видимость          = СписокПараметровНаработки;
	Элементы.ГруппаПараметрНаработки.Видимость     = Не СписокПараметровНаработки;
	Элементы.СписокПараметровНаработки.Доступность = Объект.ИспользоватьПараметрыНаработки;

КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ИспПериодичность = Объект.ИспользоватьПериодичность;
	ИспПараметрыНаработки = Объект.ИспользоватьПараметрыНаработки;
	
	Если Объект.ИспользоватьПериодичность ИЛИ Объект.ИспользоватьПараметрыНаработки Тогда
		
		Если НЕ ИспПериодичность Тогда
			Объект.ПериодичностьРемонтныхРабот   = "";
			Объект.КоличествоПериодов            = "";
		Иначе
			
			Если Не ЗначениеЗаполнено(Объект.ПериодичностьРемонтныхРабот) Тогда
				ТекстСообщения = НСтр("ru = 'Не заполнено поле ""Периодичность ремонтных работ"".'");
				ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,, "ПериодичностьРемонтныхРабот", "Объект", Отказ);
			КонецЕсли; 
		
		КонецЕсли;
		
		Если НЕ ИспПараметрыНаработки Тогда
			Объект.ПараметрНаработки             = "";
			Объект.ЗначениеПараметраНаработки    = 0;
			Объект.ПараметрыНаработки.Очистить();
		Иначе
			
			Если СписокПараметровНаработки Тогда
				
				Если Объект.ПараметрыНаработки.Количество() = 0 Тогда
					ТекстСообщения = НСтр("ru = 'Не заполнена табличная часть ""Параметры наработки"".'");
					ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,, "ПараметрыНаработки", "Объект", Отказ);
				КонецЕсли;
				
				Для Каждого СтрокаТЧ Из Объект.ПараметрыНаработки Цикл
					
					Если Не ЗначениеЗаполнено(СтрокаТЧ.ПараметрНаработки) Тогда
						ТекстСообщения = НСтр("ru = 'Не заполнено поле в табличной части ""Параметр наработки"".'");
						ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,, "Объект.ПараметрыНаработки["+ (СтрокаТЧ.НомерСтроки - 1) + "].ПараметрНаработки",, Отказ);
					КонецЕсли;
					
					Если Не ЗначениеЗаполнено(СтрокаТЧ.ЗначениеПараметраНаработки) Тогда
						ТекстСообщения = НСтр("ru = 'Не заполнено поле в табличной части ""Значение параметра наработки"".'");
						ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,, "Объект.ПараметрыНаработки["+ (СтрокаТЧ.НомерСтроки - 1) + "].ЗначениеПараметраНаработки",, Отказ);
					КонецЕсли;
					
				КонецЦикла;
				
			Иначе
				
				Если Не ЗначениеЗаполнено(ПараметрНаработки) Тогда
					ТекстСообщения = НСтр("ru = 'Не заполнено поле ""Параметр наработки"".'");
					ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,"ПараметрНаработки",, Отказ);
				КонецЕсли;
				
				Если Не ЗначениеЗаполнено(ЗначениеПараметраНаработки) Тогда
					ТекстСообщения = НСтр("ru = 'Не заполнено поле ""Значение параметра наработки"".'");
					ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,"ЗначениеПараметраНаработки",, Отказ);
				КонецЕсли;
				
			КонецЕсли;
		
		КонецЕсли;
		
		Если НЕ УчитыватьДеньНедели Тогда
			ДеньНедели = ПредопределенноеЗначение("Перечисление.ДниНедели.ПустаяСсылка");
		ИначеЕсли Не ЗначениеЗаполнено(ДеньНедели) Тогда
			ДеньНедели = ПредопределенноеЗначение("Перечисление.ДниНедели.Понедельник");
		КонецЕсли;
		
	Иначе
		ТекстСообщения = НСтр("ru = 'В способе планирования ремонтных работ нельзя одновременно отключить использование периодичности и параметров наработки!'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,, Отказ);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	Объект.ПараметрНаработки = ПараметрНаработки;
	Объект.ЗначениеПараметраНаработки = ЗначениеПараметраНаработки;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	// СтандартныеПодсистемы.Свойства 
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура УчитыватьДеньНеделиПриИзменении(Элемент)
			
	Если Не УчитыватьДеньНедели И ЗначениеЗаполнено(Объект.ДеньНедели) Тогда
		Ответ = Неопределено;

		ПоказатьВопрос(Новый ОписаниеОповещения("УчитыватьДеньНеделиПриИзмененииЗавершение", ЭтотОбъект), НСтр("ru = 'Поле ""День недели"" будет очищено. Продолжить?'"),РежимДиалогаВопрос.ДаНет,0);
        Возврат;
		
		
	КонецЕсли;
	УчитыватьДеньНеделиПриИзмененииФрагмент();
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьПериодичностьПриИзменении(Элемент)
		Элементы.ГруппаПериодичность.Видимость   = Объект.ИспользоватьПериодичность;/////
		Элементы.УчитыватьДеньНедели.Доступность = Объект.ИспользоватьПериодичность;
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьПараметрыНаработкиПриИзменении(Элемент)
	Элементы.ГруппаПараметрыНаработки.Видимость  = Объект.ИспользоватьПараметрыНаработки;/////
	Элементы.СписокПараметровНаработки.Доступность = Объект.ИспользоватьПараметрыНаработки;
КонецПроцедуры

&НаКлиенте
Процедура ПараметрНаработкиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	ОтразитьИзменениеНаработкиВТаблице(ВыбранноеЗначение);
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеПараметраНаработкиПриИзменении(Элемент)
	ОтразитьИзменениеНаработкиВТаблице(ЗначениеПараметраНаработки);
КонецПроцедуры

&НаКлиенте
Процедура СписокПараметровНаработкиПриИзменении(Элемент)
	Если Объект.ПараметрыНаработки.Количество() > 1 И Не СписокПараметровНаработки Тогда
		
		Ответ = Неопределено;

		
		ПоказатьВопрос(Новый ОписаниеОповещения("СписокПараметровНаработкиПриИзмененииЗавершение", ЭтотОбъект), НСтр("ru = 'Все строки параметров наработки, кроме первой, будут удалены. Продолжить?'"),РежимДиалогаВопрос.ДаНет,0);
        Возврат;
	КонецЕсли;
	
	СписокПараметровНаработкиПриИзмененииФрагмент();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПараметрыНаработки
&НаКлиенте
Процедура ПараметрыНаработкиПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	Если НЕ ОтменаРедактирования Тогда
		
		ТекДанные = Элемент.ТекущиеДанные;
		МассивСтрок = Объект.ПараметрыНаработки.НайтиСтроки(НОвый Структура("ПараметрНаработки", ТекДанные.ПараметрНаработки));
		Если МассивСтрок.Количество() > 1 Тогда
			ТекстСообщения = НСтр("ru = 'Данный параметр наработки уже добавлен!'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы
// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаКлиенте
Процедура УчитыватьДеньНеделиПриИзмененииЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
    Ответ = РезультатВопроса;
    
    Если Ответ = КодВозвратаДиалога.Да Тогда
        
        Объект.ДеньНедели = ПредопределенноеЗначение("Перечисление.ДниНедели.ПустаяСсылка");
        
    Иначе УчитыватьДеньНедели = Истина;
    КонецЕсли;
    
    
    
    УчитыватьДеньНеделиПриИзмененииФрагмент();

КонецПроцедуры

&НаКлиенте
Процедура УчитыватьДеньНеделиПриИзмененииФрагмент()
    
    Элементы.ДеньНедели.Доступность = УчитыватьДеньНедели;

КонецПроцедуры

&НаКлиенте
Процедура ОтразитьИзменениеНаработкиВТаблице(Значение)
	
	Если Объект.ПараметрыНаработки.Количество() > 0 Тогда
		СтрокаРедактирования = Объект.ПараметрыНаработки[0];
	Иначе
		СтрокаРедактирования = Объект.ПараметрыНаработки.Добавить();
	КонецЕсли;
	
	Если ТипЗнч(Значение) = Тип("СправочникСсылка.ПараметрыВыработкиОС") Тогда
		СтрокаРедактирования.ПараметрНаработки = Значение;
	ИначеЕсли ТипЗнч(Значение) = Тип("Число") Тогда
		СтрокаРедактирования.ЗначениеПараметраНаработки = Значение;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПараметровНаработкиПриИзмененииЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
    Ответ = РезультатВопроса;
    
    Если Ответ = КодВозвратаДиалога.Да Тогда
        
        Пока Объект.ПараметрыНаработки.Количество() > 1 Цикл
            СтрокаУдаления = Объект.ПараметрыНаработки[1];
            Объект.ПараметрыНаработки.Удалить(СтрокаУдаления);
        КонецЦикла;
        
    Иначе 
        СписокПараметровНаработки = Истина;
    КонецЕсли;
    
    СписокПараметровНаработкиПриИзмененииФрагмент();

КонецПроцедуры

&НаКлиенте
Процедура СписокПараметровНаработкиПриИзмененииФрагмент()
    
    Если Не СписокПараметровНаработки Тогда
        Если Объект.ПараметрыНаработки.Количество() > 0 Тогда
            ПараметрНаработки          = Объект.ПараметрыНаработки[0].ПараметрНаработки;
            ЗначениеПараметраНаработки = Объект.ПараметрыНаработки[0].ЗначениеПараметраНаработки;
        КонецЕсли;
    КонецЕсли;
    Элементы.ПараметрыНаработки.Видимость = СписокПараметровНаработки;
    Элементы.ГруппаПараметрНаработки.Видимость = Не СписокПараметровНаработки;

КонецПроцедуры

// СтандартныеПодсистемы.Свойства 
&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
      УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
 
&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
      УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры
 
&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры
 
&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры
 
&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)	
	СтандартнаяОбработка = Ложь;
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(
		Элемент.ТекстРедактирования, ЭтотОбъект, "Объект.Комментарий");
КонецПроцедуры

#КонецОбласти
